{
    "name" : "Perry",
    "tags" : ["Java developer", "Looking for 2019 summer intern", "Can also fly above water"],
    "about" : ["I like backend and learn all the interesting tech.", "I stay close to the community", "My dream is to code crazily for days without any concern and anxiety."],
    "github" : "https://github.com/PerrySong",
    "avatar" : "https://avatars1.githubusercontent.com/u/26971233?s=400&u=455f0e5ba91af118a6ea1eaed9a8ef7d5233bb70&v=4",
    "linkedin" : "www.linkedin.com/in/perrycrazycoding",
    "projects" : [
        {  
            "name" : "Crypto Portfolio",
            "desc" : "A Java-based web application with metadata fetched from the Last.fm APIs and processed using the multithreaded approach",
            "techs" : [
                "JavaScript",
                "React",
                "node.js",
                "aws"
            ],
            "highlights" : [
                "Designed and built a web-based cryptocurrency management social app worked in a team of 5 people. (CryptoCompared API)",
                "Developed backend services using RESTful API with comprehensive documentation and successfully deployed onto AWS EC2. (Node.js, Express, React, Postgresql, AWS, Nginx, Markdown, JWT, Nodemailer.js)",
                "Implemented a user-based investment recommendation system based on users’ current investment. (Raccoon.js, Redis)"
                ],
            "links" : [
                    {
                        "name" : "Github",
                        "href" : "https://github.com/PerrySong/CryptoPortfolio-Nodejs"
                    }
                ]
        },
        {   
            "name" : "CandyFM",
            "desc" : "This is a Web app",
            "techs" : [
                "Java",
                "html5",
                "css3",
                "lastfm"
            ],
            "links" : [
                    {
                        "name" : "Github",
                        "href" : "https://github.com/PerrySong/CandyFm"
                    }
                ],
            "highlights" : [
                "Built a Java-based web application with metadata fetched from the Last.fm APIs and processed using the multithreaded approach (Java concurrency), 3 times faster than a single thread.",
                "Used MVC pattern and Java Jetty/Servlets to build the web app and used Travis-ci and JUnit for testing.",
                "Application features include but not limited: recommend similar songs by title, tags, or artist names, authentication, authorization, search history, popular searches, favorite songs, and partial search."
            ]

        },
        {   
            "name" : "AleperyChat",
            "desc" : "Online video chat Android app using Opentok and using Affectiva detect and evaluate users’ facial expression",
            "techs" : [
                "android",
                "java"
            ],
            "highlights" : [
                "Implemented an online video chat Android app using Opentok and using Affectiva detect and evaluate users’ facial expression.",
                "Used Firebase for user’s facial expression data storage and smoothed the user facial expression value by sliding windows.",
                "Implemented Collaborative Filtering algorithm to compute user and dating partner’s real-time facial synchronization level to assess the affections of a chat."

            ],
            "links" : [
                    {
                        "name" : "Github",
                        "href" : "https://github.com/PerrySong/AleperyChat"
                    }
                ]
        },
        {   
            "name" : "Real-Time News Web App",
            "desc" : "A real-time news scraping data pipeline which has news monitoring, scraping and deduping servic",
            "techs" : [
                "rabbitMQ",
                "python",
                "node.js",
                "html5",
                "css3"
            ],
            "highlights" : [
                "Implemented a real-time news scraping data pipeline which has news monitoring, scraping and deduping services. (Python, News API)",
                "Used RabbitMQ to connect different services, TF-IDF for deduping news, MongoDB for data storage and Node.js for news display."

            ],
            "links" : [
                    {
                        "name" : "Github",
                        "href" : "https://github.com/PerrySong/Top-crypto-news-api"
                    }
                ]
        },
        {   
            "name" : "RESTful Campground Web App",
            "desc" : "A social media web application for users to share campgrounds",
            "techs" : [
                "javascript",
                "node.js",
                "html5",
                "css3"
            ],
            "highlights" : [
                "Designed a social media web application for users to share campgrounds and deployed this app on Heroku.", 
                "Application features include but not limited: recommend similar songs by title, tags, or artist names, authentication, authorization, search history, popular searches, favorite songs, and partial search.",
                "Wrote reusable HTML templates using EJS view engine and styled web pages using Bootstrap." 

            ],
            "links" : [
                    {
                        "name" : "Github",
                        "href" : "https://github.com/PerrySong/Top-crypto-news-api"
                    },
                    {
                        "name" : "Website",
                        "href" : "https://hidden-headland-22449.herokuapp.com/"
                    }
                ]
        }
    ]

}